FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_debug_console.c
/*
 * This is a modified version of the file printf.c, which was distributed
 * by Motorola as part of the M5407C3BOOT.zip package used to initialize
 * the M5407C3 evaluation board.
 *
 * Copyright:
 *      1999-2000 MOTOROLA, INC. All Rights Reserved.
 *  You are hereby granted a copyright license to use, modify, and
 *  distribute the SOFTWARE so long as this entire notice is
 *  retained without alteration in any modified and/or redistributed
 *  versions, and that such modified versions are clearly identified
 *  as such. No licenses are granted by implication, estoppel or
 *  otherwise under any patents or trademarks of Motorola, Inc. This
 *  software is provided on an "AS IS" basis and without warranty.
 *
 *  To the maximum extent permitted by applicable law, MOTOROLA
 *  DISCLAIMS ALL WARRANTIES WHETHER EXPRESS OR IMPLIED, INCLUDING
 *  IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR
 *  PURPOSE AND ANY WARRANTY AGAINST INFRINGEMENT WITH REGARD TO THE
 *  SOFTWARE (INCLUDING ANY MODIFIED VERSIONS THEREOF) AND ANY
 *  ACCOMPANYING WRITTEN MATERIALS.
 *
 *  To the maximum extent permitted by applicable law, IN NO EVENT
 *  SHALL MOTOROLA BE LIABLE FOR ANY DAMAGES WHATSOEVER (INCLUDING
 *  WITHOUT LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS
 *  INTERRUPTION, LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY
 *  LOSS) ARISING OF THE USE OR INABILITY TO USE THE SOFTWARE.
 *
 *  Motorola assumes no responsibility for the maintenance and support
 *  of this software
 *
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <stdarg.h>
#include <stdlib.h>
#if defined( __CC_ARM ) || defined( __ARMCC_VERSION )
    #include <stdio.h>
#endif

#ifdef FSL_RTOS_FREE_RTOS
    #include "FreeRTOS.h"
    #include "semphr.h"
    #include "task.h"
#endif

#include "fsl_debug_console_conf.h"
#include "fsl_str.h"

#include "fsl_common.h"
#include "serial_manager.h"

#include "fsl_debug_console.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#ifndef NDEBUG
    #if ( defined( DEBUG_CONSOLE_ASSERT_DISABLE ) && ( DEBUG_CONSOLE_ASSERT_DISABLE > 0U ) )
        #undef assert
        #define assert( n )
    #endif
#endif

#if SDK_DEBUGCONSOLE
    #define DEBUG_CONSOLE_FUNCTION_PREFIX
#else
    #define DEBUG_CONSOLE_FUNCTION_PREFIX    static
#endif

/*! @brief character backspace ASCII value */
#define DEBUG_CONSOLE_BACKSPACE    127U

/* lock definition */
#if ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_FREERTOS )

    static SemaphoreHandle_t s_debugConsoleReadSemaphore;
    #if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) )
        static SemaphoreHandle_t s_debugConsoleReadWaitSemaphore;
    #endif

#elif ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_BM )

    #if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) )
        static volatile uint8_t s_debugConsoleReadWaitSemaphore;
    #endif

#else  /* if ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_FREERTOS ) */

#endif /* DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_FREERTOS */

/*! @brief get current runing environment is ISR or not */
#ifdef __CA7_REV
    #define IS_RUNNING_IN_ISR()    SystemGetIRQNestingLevel()
#else
    #define IS_RUNNING_IN_ISR()    __get_IPSR()
#endif /* __CA7_REV */

/* semaphore definition */
#if ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_FREERTOS )

/* mutex semaphore */
/* clang-format off */
    #define DEBUG_CONSOLE_CREATE_MUTEX_SEMAPHORE( mutex )    ( ( mutex ) = xSemaphoreCreateMutex() )
    #define DEBUG_CONSOLE_DESTROY_MUTEX_SEMAPHORE( mutex ) \
    do                                                     \
    {                                                      \
        if( NULL != mutex )                                \
        {                                                  \
            vSemaphoreDelete( mutex );                     \
            mutex = NULL;                                  \
        }                                                  \
    } while( 0 )

    #define DEBUG_CONSOLE_GIVE_MUTEX_SEMAPHORE( mutex ) \
    {                                                   \
        if( IS_RUNNING_IN_ISR() == 0U )                 \
        {                                               \
            ( void ) xSemaphoreGive( mutex );           \
        }                                               \
    }

    #define DEBUG_CONSOLE_TAKE_MUTEX_SEMAPHORE_BLOCKING( mutex ) \
    {                                                            \
        if( IS_RUNNING_IN_ISR() == 0U )                          \
        {                                                        \
            ( void ) xSemaphoreTake( mutex, portMAX_DELAY );     \
        }                                                        \
    }

    #define DEBUG_CONSOLE_TAKE_MUTEX_SEMAPHORE_NONBLOCKING( mutex, result ) \
    {                                                                       \
        if( IS_RUNNING_IN_ISR() == 0U )                                     \
        {                                                                   \
            result = xSemaphoreTake( mutex, 0U );                           \
        }                                                                   \
        else                                                                \
        {                                                                   \
            result = 1U;                                                    \
        }                                                                   \
    }

/* Binary semaphore */
    #define DEBUG_CONSOLE_CREATE_BINARY_SEMAPHORE( binary )           ( ( binary ) = xSemaphoreCreateBinary() )
    #define DEBUG_CONSOLE_DESTROY_BINARY_SEMAPHORE( binary ) \
    do                                                       \
    {                                                        \
        if( NULL != binary )                                 \
        {                                                    \
            vSemaphoreDelete( binary );                      \
            binary = NULL;                                   \
        }                                                    \
    } while( 0 )
    #define DEBUG_CONSOLE_TAKE_BINARY_SEMAPHORE_BLOCKING( binary )    ( ( void ) xSemaphoreTake( binary, portMAX_DELAY ) )
    #define DEBUG_CONSOLE_GIVE_BINARY_SEMAPHORE_FROM_ISR( binary )    ( ( void ) xSemaphoreGiveFromISR( binary, NULL ) )

#elif ( DEBUG_CONSOLE_SYNCHRONIZATION_BM == DEBUG_CONSOLE_SYNCHRONIZATION_MODE )

    #define DEBUG_CONSOLE_CREATE_MUTEX_SEMAPHORE( mutex )
    #define DEBUG_CONSOLE_DESTROY_MUTEX_SEMAPHORE( mutex )
    #define DEBUG_CONSOLE_TAKE_MUTEX_SEMAPHORE_BLOCKING( mutex )
    #define DEBUG_CONSOLE_GIVE_MUTEX_SEMAPHORE( mutex )
    #define DEBUG_CONSOLE_TAKE_MUTEX_SEMAPHORE_NONBLOCKING( mutex, result )    ( result = 1U )

    #define DEBUG_CONSOLE_CREATE_BINARY_SEMAPHORE( binary )
    #define DEBUG_CONSOLE_DESTROY_BINARY_SEMAPHORE( binary )
    #ifdef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #define DEBUG_CONSOLE_TAKE_BINARY_SEMAPHORE_BLOCKING( binary ) \
    {                                                                  \
        while( !binary )                                               \
        {                                                              \
        }                                                              \
        binary = false;                                                \
    }
        #define DEBUG_CONSOLE_GIVE_BINARY_SEMAPHORE_FROM_ISR( binary )    ( binary = true )
    #else
        #define DEBUG_CONSOLE_TAKE_BINARY_SEMAPHORE_BLOCKING( binary )
        #define DEBUG_CONSOLE_GIVE_BINARY_SEMAPHORE_FROM_ISR( binary )
    #endif /* DEBUG_CONSOLE_TRANSFER_NON_BLOCKING */
/* clang-format on */

/* add other implementation here
 * such as :
 * #elif(DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DDEBUG_CONSOLE_SYNCHRONIZATION_xxx)
 */

#else  /* if ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_FREERTOS ) */

    #error RTOS type is not defined by DEBUG_CONSOLE_SYNCHRONIZATION_MODE.

#endif /* DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_FREERTOS */

#ifdef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
/* receive state structure */
    typedef struct _debug_console_write_ring_buffer
    {
        uint32_t ringBufferSize;
        volatile uint32_t ringHead;
        volatile uint32_t ringTail;
        uint8_t ringBuffer[ DEBUG_CONSOLE_TRANSMIT_BUFFER_LEN ];
    } debug_console_write_ring_buffer_t;
#endif

typedef struct _debug_console_state_struct
{
    uint8_t serialHandleBuffer[ SERIAL_MANAGER_HANDLE_SIZE ];
    serial_handle_t serialHandle; /*!< serial manager handle */
    #ifdef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        debug_console_write_ring_buffer_t writeRingBuffer;
        uint8_t readRingBuffer[ DEBUG_CONSOLE_RECEIVE_BUFFER_LEN ];
    #endif
    uint8_t serialWriteHandleBuffer[ SERIAL_MANAGER_WRITE_HANDLE_SIZE ];
    uint8_t serialReadHandleBuffer[ SERIAL_MANAGER_READ_HANDLE_SIZE ];
} debug_console_state_struct_t;

