FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_debug_console.c
/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! @brief Debug console state information. */
#if ( defined( DATA_SECTION_IS_CACHEABLE ) && ( DATA_SECTION_IS_CACHEABLE > 0 ) )
    AT_NONCACHEABLE_SECTION( static debug_console_state_struct_t s_debugConsoleState );
#else
    static debug_console_state_struct_t s_debugConsoleState;
#endif
serial_handle_t g_serialHandle; /*!< serial manager handle */

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief This is a printf call back function which is used to relocate the log to buffer
 * or print the log immediately when the local buffer is full.
 *
 * @param[in] buf   Buffer to store log.
 * @param[in] indicator Buffer index.
 * @param[in] val Target character to store.
 * @param[in] len length of the character
 *
 */
#if SDK_DEBUGCONSOLE
    static void DbgConsole_PrintCallback( char * buf,
                                          int32_t * indicator,
                                          char dbgVal,
                                          int len );
#endif

status_t DbgConsole_ReadOneCharacter( uint8_t * ch );
int DbgConsole_SendData( uint8_t * ch,
                         size_t size );
int DbgConsole_SendDataReliable( uint8_t * ch,
                                 size_t size );
int DbgConsole_ReadLine( uint8_t * buf,
                         size_t size );
int DbgConsole_ReadCharacter( uint8_t * ch );

#if ( ( SDK_DEBUGCONSOLE > 0U ) ||                                                    \
    ( ( SDK_DEBUGCONSOLE == 0U ) && defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING ) && \
    ( defined( DEBUG_CONSOLE_TX_RELIABLE_ENABLE ) && ( DEBUG_CONSOLE_TX_RELIABLE_ENABLE > 0U ) ) ) )
    DEBUG_CONSOLE_FUNCTION_PREFIX status_t DbgConsole_Flush( void );
#endif

/*******************************************************************************
 * Code
 ******************************************************************************/

#if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )

    static void DbgConsole_SerialManagerTxCallback( void * callbackParam,
                                                    serial_manager_callback_message_t * message,
                                                    serial_manager_status_t status )
    {
        debug_console_state_struct_t * ioState;
        uint32_t sendDataLength;

        if( ( NULL == callbackParam ) || ( NULL == message ) )
        {
            return;
        }

        ioState = ( debug_console_state_struct_t * ) callbackParam;

        ioState->writeRingBuffer.ringTail += message->length;

        if( ioState->writeRingBuffer.ringTail >= ioState->writeRingBuffer.ringBufferSize )
        {
            ioState->writeRingBuffer.ringTail = 0U;
        }

        if( kStatus_SerialManager_Success == status )
        {
            if( ioState->writeRingBuffer.ringTail != ioState->writeRingBuffer.ringHead )
            {
                if( ioState->writeRingBuffer.ringHead > ioState->writeRingBuffer.ringTail )
                {
                    sendDataLength = ioState->writeRingBuffer.ringHead - ioState->writeRingBuffer.ringTail;
                }
                else
                {
                    sendDataLength = ioState->writeRingBuffer.ringBufferSize - ioState->writeRingBuffer.ringTail;
                }

                ( void ) SerialManager_WriteNonBlocking(
                    ( ( serial_write_handle_t ) &ioState->serialWriteHandleBuffer[ 0 ] ),
                    &ioState->writeRingBuffer.ringBuffer[ ioState->writeRingBuffer.ringTail ], sendDataLength );
            }
        }
        else if( kStatus_SerialManager_Canceled == status )
        {
            ioState->writeRingBuffer.ringTail = 0U;
            ioState->writeRingBuffer.ringHead = 0U;
        }
        else
        {
            /*MISRA rule 16.4*/
        }
    }

    #if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) )

        static void DbgConsole_SerialManagerRxCallback( void * callbackParam,
                                                        serial_manager_callback_message_t * message,
                                                        serial_manager_status_t status )
        {
            if( ( NULL == callbackParam ) || ( NULL == message ) )
            {
                return;
            }

            if( kStatus_SerialManager_Notify == status )
            {
            }
            else if( kStatus_SerialManager_Success == status )
            {
                /* release s_debugConsoleReadWaitSemaphore from RX callback */
                DEBUG_CONSOLE_GIVE_BINARY_SEMAPHORE_FROM_ISR( s_debugConsoleReadWaitSemaphore );
            }
            else
            {
                /*MISRA rule 16.4*/
            }
        }
    #endif /* if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) ) */

#endif /* if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING ) */

status_t DbgConsole_ReadOneCharacter( uint8_t * ch )
{
    #if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) )
        #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING ) && \
        ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_BM ) && defined( OSA_USED )
            return kStatus_Fail;
        #else
            status_t status = ( status_t ) kStatus_SerialManager_Error;

/* recieve one char every time */
            #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
                status = ( status_t ) SerialManager_ReadNonBlocking(
                    ( ( serial_read_handle_t ) &s_debugConsoleState.serialReadHandleBuffer[ 0 ] ), ch, 1 );
            #else
                status = ( status_t ) SerialManager_ReadBlocking(
                    ( ( serial_read_handle_t ) &s_debugConsoleState.serialReadHandleBuffer[ 0 ] ), ch, 1 );
            #endif

            if( ( status_t ) kStatus_SerialManager_Success != status )
            {
                return ( status_t ) kStatus_Fail;
            }

            /* wait s_debugConsoleReadWaitSemaphore from RX callback */
            DEBUG_CONSOLE_TAKE_BINARY_SEMAPHORE_BLOCKING( s_debugConsoleReadWaitSemaphore );

            return ( status_t ) kStatus_Success;
        #endif /* if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING ) && ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_BM ) && defined( OSA_USED ) */
    #else  /* if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) ) */
        return ( status_t ) kStatus_Fail;
    #endif /* if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) ) */
}

