FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_debug_console.c
#if DEBUG_CONSOLE_ENABLE_ECHO_FUNCTION
    static status_t DbgConsole_EchoCharacter( uint8_t * ch,
                                              bool isGetChar,
                                              int * index )
    {
        /* Due to scanf take \n and \r as end of string,should not echo */
        if( ( ( *ch != ( uint8_t ) '\r' ) && ( *ch != ( uint8_t ) '\n' ) ) || ( isGetChar ) )
        {
            /* recieve one char every time */
            if( 1 != DbgConsole_SendDataReliable( ch, 1U ) )
            {
                return ( status_t ) kStatus_Fail;
            }
        }

        if( ( !isGetChar ) && ( index != NULL ) )
        {
            if( DEBUG_CONSOLE_BACKSPACE == *ch )
            {
                if( ( *index >= 2 ) )
                {
                    *index -= 2;
                }
                else
                {
                    *index = 0;
                }
            }
        }

        return ( status_t ) kStatus_Success;
    }
#endif /* if DEBUG_CONSOLE_ENABLE_ECHO_FUNCTION */

int DbgConsole_SendData( uint8_t * ch,
                         size_t size )
{
    status_t status = ( status_t ) kStatus_SerialManager_Error;

    #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
        uint32_t sendDataLength;
        int txBusy = 0;
    #endif
    assert( NULL != ch );
    assert( 0 != size );

    #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
        uint32_t regPrimask = DisableGlobalIRQ();

        if( s_debugConsoleState.writeRingBuffer.ringHead != s_debugConsoleState.writeRingBuffer.ringTail )
        {
            txBusy = 1;
            sendDataLength =
                ( s_debugConsoleState.writeRingBuffer.ringHead + s_debugConsoleState.writeRingBuffer.ringBufferSize -
                  s_debugConsoleState.writeRingBuffer.ringTail ) %
                s_debugConsoleState.writeRingBuffer.ringBufferSize;
        }
        else
        {
            sendDataLength = 0U;
        }

        sendDataLength = s_debugConsoleState.writeRingBuffer.ringBufferSize - sendDataLength - 1;

        if( sendDataLength < size )
        {
            EnableGlobalIRQ( regPrimask );
            return -1;
        }

        for( int i = 0; i < ( int ) size; i++ )
        {
            s_debugConsoleState.writeRingBuffer.ringBuffer[ s_debugConsoleState.writeRingBuffer.ringHead++ ] = ch[ i ];

            if( s_debugConsoleState.writeRingBuffer.ringHead >= s_debugConsoleState.writeRingBuffer.ringBufferSize )
            {
                s_debugConsoleState.writeRingBuffer.ringHead = 0U;
            }
        }

        status = ( status_t ) kStatus_SerialManager_Success;

        if( txBusy == 0 )
        {
            if( s_debugConsoleState.writeRingBuffer.ringHead > s_debugConsoleState.writeRingBuffer.ringTail )
            {
                sendDataLength =
                    s_debugConsoleState.writeRingBuffer.ringHead - s_debugConsoleState.writeRingBuffer.ringTail;
            }
            else
            {
                sendDataLength =
                    s_debugConsoleState.writeRingBuffer.ringBufferSize - s_debugConsoleState.writeRingBuffer.ringTail;
            }

            status = ( status_t ) SerialManager_WriteNonBlocking(
                ( ( serial_write_handle_t ) &s_debugConsoleState.serialWriteHandleBuffer[ 0 ] ),
                &s_debugConsoleState.writeRingBuffer.ringBuffer[ s_debugConsoleState.writeRingBuffer.ringTail ],
                sendDataLength );
        }

        EnableGlobalIRQ( regPrimask );
    #else  /* if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING ) */
        status = ( status_t ) SerialManager_WriteBlocking(
            ( ( serial_write_handle_t ) &s_debugConsoleState.serialWriteHandleBuffer[ 0 ] ), ch, size );
    #endif /* if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING ) */
    return( ( ( status_t ) kStatus_Success == status ) ? ( int ) size : -1 );
}

int DbgConsole_SendDataReliable( uint8_t * ch,
                                 size_t size )
{
    #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
        #if ( defined( DEBUG_CONSOLE_TX_RELIABLE_ENABLE ) && ( DEBUG_CONSOLE_TX_RELIABLE_ENABLE > 0U ) )
            status_t status = kStatus_SerialManager_Error;
            uint32_t sendDataLength;
            uint32_t totalLength = size;
            int sentLength;
        #endif /* DEBUG_CONSOLE_TX_RELIABLE_ENABLE */
    #else
        status_t status = kStatus_SerialManager_Error;
    #endif /* DEBUG_CONSOLE_TRANSFER_NON_BLOCKING */

    assert( NULL != ch );
    assert( 0 != size );

    if( NULL == g_serialHandle )
    {
        return 0;
    }

    #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
        #if ( defined( DEBUG_CONSOLE_TX_RELIABLE_ENABLE ) && ( DEBUG_CONSOLE_TX_RELIABLE_ENABLE > 0U ) )
            do
            {
                uint32_t regPrimask = DisableGlobalIRQ();

                if( s_debugConsoleState.writeRingBuffer.ringHead != s_debugConsoleState.writeRingBuffer.ringTail )
                {
                    sendDataLength =
                        ( s_debugConsoleState.writeRingBuffer.ringHead + s_debugConsoleState.writeRingBuffer.ringBufferSize -
                          s_debugConsoleState.writeRingBuffer.ringTail ) %
                        s_debugConsoleState.writeRingBuffer.ringBufferSize;
                }
                else
                {
                    sendDataLength = 0U;
                }

                sendDataLength = s_debugConsoleState.writeRingBuffer.ringBufferSize - sendDataLength - 1U;

                if( sendDataLength > 0U )
                {
                    if( sendDataLength > totalLength )
                    {
                        sendDataLength = totalLength;
                    }

                    sentLength = DbgConsole_SendData( &ch[ size - totalLength ], sendDataLength );

                    if( sentLength > 0 )
                    {
                        totalLength = totalLength - ( uint32_t ) sentLength;
                    }
                }

