FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_debug_console.c
                EnableGlobalIRQ( regPrimask );

                if( totalLength != 0U )
                {
                    status = DbgConsole_Flush();

                    if( ( status_t ) kStatus_Success != status )
                    {
                        break;
                    }
                }
            } while( totalLength != 0U );

            return ( status_t ) ( uint32_t ) ( ( uint32_t ) size - totalLength );
        #else  /* if ( defined( DEBUG_CONSOLE_TX_RELIABLE_ENABLE ) && ( DEBUG_CONSOLE_TX_RELIABLE_ENABLE > 0U ) ) */
            return DbgConsole_SendData( ch, size );
        #endif /* DEBUG_CONSOLE_TX_RELIABLE_ENABLE */
    #else  /* if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING ) */
        status = ( status_t ) SerialManager_WriteBlocking(
            ( ( serial_write_handle_t ) &s_debugConsoleState.serialWriteHandleBuffer[ 0 ] ), ch, size );
        return( ( ( status_t ) kStatus_Success == status ) ? ( int ) size : -1 );
    #endif /* DEBUG_CONSOLE_TRANSFER_NON_BLOCKING */
}

int DbgConsole_ReadLine( uint8_t * buf,
                         size_t size )
{
    int i = 0;

    assert( buf != NULL );

    if( NULL == g_serialHandle )
    {
        return -1;
    }

    /* take mutex lock function */
    DEBUG_CONSOLE_TAKE_MUTEX_SEMAPHORE_BLOCKING( s_debugConsoleReadSemaphore );

    do
    {
        /* recieve one char every time */
        if( ( status_t ) kStatus_Success != DbgConsole_ReadOneCharacter( &buf[ i ] ) )
        {
            /* release mutex lock function */
            DEBUG_CONSOLE_GIVE_MUTEX_SEMAPHORE( s_debugConsoleReadSemaphore );
            i = -1;
            break;
        }

        #if DEBUG_CONSOLE_ENABLE_ECHO_FUNCTION
            ( void ) DbgConsole_EchoCharacter( &buf[ i ], false, &i );
        #endif

        /* analysis data */
        if( ( ( uint8_t ) '\r' == buf[ i ] ) || ( ( uint8_t ) '\n' == buf[ i ] ) )
        {
            /* End of Line. */
            if( 0 == i )
            {
                buf[ i ] = ( uint8_t ) '\0';
                continue;
            }
            else
            {
                break;
            }
        }

        i++;
    } while( i < ( int ) size );

    /* get char should not add '\0'*/
    if( i == ( int ) size )
    {
        buf[ i ] = ( uint8_t ) '\0';
    }
    else
    {
        buf[ i + 1 ] = ( uint8_t ) '\0';
    }

    /* release mutex lock function */
    DEBUG_CONSOLE_GIVE_MUTEX_SEMAPHORE( s_debugConsoleReadSemaphore );

    return i;
}

int DbgConsole_ReadCharacter( uint8_t * ch )
{
    int ret;

    assert( ch );

    if( NULL == g_serialHandle )
    {
        return -1;
    }

    /* take mutex lock function */
    DEBUG_CONSOLE_TAKE_MUTEX_SEMAPHORE_BLOCKING( s_debugConsoleReadSemaphore );

    /* read one character */
    if( ( status_t ) kStatus_Success == DbgConsole_ReadOneCharacter( ch ) )
    {
        ret = 1;
        #if DEBUG_CONSOLE_ENABLE_ECHO_FUNCTION
            ( void ) DbgConsole_EchoCharacter( ch, true, NULL );
        #endif
    }
    else
    {
        ret = -1;
    }

    /* release mutex lock function */
    DEBUG_CONSOLE_GIVE_MUTEX_SEMAPHORE( s_debugConsoleReadSemaphore );

    return ret;
}

#if SDK_DEBUGCONSOLE
    static void DbgConsole_PrintCallback( char * buf,
                                          int32_t * indicator,
                                          char dbgVal,
                                          int len )
    {
        int i = 0;

        for( i = 0; i < len; i++ )
        {
            if( ( ( uint32_t ) *indicator + 1UL ) >= DEBUG_CONSOLE_PRINTF_MAX_LOG_LEN )
            {
                ( void ) DbgConsole_SendDataReliable( ( uint8_t * ) buf, ( uint32_t ) ( *indicator ) );
                *indicator = 0;
            }

            buf[ *indicator ] = dbgVal;
            ( *indicator )++;
        }
    }
#endif /* if SDK_DEBUGCONSOLE */

/*************Code for DbgConsole Init, Deinit, Printf, Scanf *******************************/

#if ( ( SDK_DEBUGCONSOLE == DEBUGCONSOLE_REDIRECT_TO_SDK ) || defined( SDK_DEBUGCONSOLE_UART ) )
/* See fsl_debug_console.h for documentation of this function. */
    status_t DbgConsole_Init( uint8_t instance,
                              uint32_t baudRate,
                              serial_port_type_t device,
                              uint32_t clkSrcFreq )
    {
        serial_manager_config_t serialConfig;
        status_t status = ( status_t ) kStatus_SerialManager_Error;

        #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
            serial_port_uart_config_t uartConfig =
            {
                .instance     = instance,
                .clockRate    = clkSrcFreq,
                .baudRate     = baudRate,
                .parityMode   = kSerialManager_UartParityDisabled,
                .stopBitCount = kSerialManager_UartOneStopBit,
                .enableRx     = 1,
                .enableTx     = 1,
            };
        #endif /* if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) ) */

        #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
            serial_port_usb_cdc_config_t usbCdcConfig =
            {
                .controllerIndex = ( serial_port_usb_cdc_controller_index_t ) instance,
            };
        #endif

        #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
            serial_port_swo_config_t swoConfig =
            {
                .clockRate = clkSrcFreq,
                .baudRate  = baudRate,
                .port      = instance,
                .protocol  = kSerialManager_SwoProtocolNrz,
            };
        #endif

        #if ( defined( SERIAL_PORT_TYPE_USBCDC_VIRTUAL ) && ( SERIAL_PORT_TYPE_USBCDC_VIRTUAL > 0U ) )
            serial_port_usb_cdc_virtual_config_t usbCdcVirtualConfig =
            {
                .controllerIndex = ( serial_port_usb_cdc_virtual_controller_index_t ) instance,
            };
        #endif
        serialConfig.type = device;
        #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
            serialConfig.ringBuffer = &s_debugConsoleState.readRingBuffer[ 0 ];
            serialConfig.ringBufferSize = DEBUG_CONSOLE_RECEIVE_BUFFER_LEN;
        #endif

        if( kSerialPort_Uart == device )
        {
            #if ( defined( SERIAL_PORT_TYPE_UART ) && ( SERIAL_PORT_TYPE_UART > 0U ) )
                serialConfig.portConfig = &uartConfig;
            #else
                return status;
            #endif
        }
        else if( kSerialPort_UsbCdc == device )
        {
            #if ( defined( SERIAL_PORT_TYPE_USBCDC ) && ( SERIAL_PORT_TYPE_USBCDC > 0U ) )
                serialConfig.portConfig = &usbCdcConfig;
            #else
                return status;
            #endif
        }
        else if( kSerialPort_Swo == device )
        {
            #if ( defined( SERIAL_PORT_TYPE_SWO ) && ( SERIAL_PORT_TYPE_SWO > 0U ) )
                serialConfig.portConfig = &swoConfig;
            #else
                return status;
            #endif
        }
        else if( kSerialPort_UsbCdcVirtual == device )
        {
            #if ( defined( SERIAL_PORT_TYPE_USBCDC_VIRTUAL ) && ( SERIAL_PORT_TYPE_USBCDC_VIRTUAL > 0U ) )
                serialConfig.portConfig = &usbCdcVirtualConfig;
            #else
                return status;
            #endif
        }
        else
        {
            return status;
        }

