FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_debug_console.c
        ( void ) memset( &s_debugConsoleState, 0, sizeof( s_debugConsoleState ) );

        #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
            s_debugConsoleState.writeRingBuffer.ringBufferSize = DEBUG_CONSOLE_TRANSMIT_BUFFER_LEN;
        #endif

        s_debugConsoleState.serialHandle = ( serial_handle_t ) &s_debugConsoleState.serialHandleBuffer[ 0 ];
        status = ( status_t ) SerialManager_Init( s_debugConsoleState.serialHandle, &serialConfig );

        assert( kStatus_SerialManager_Success == status );

        DEBUG_CONSOLE_CREATE_MUTEX_SEMAPHORE( s_debugConsoleReadSemaphore );
        #if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) )
            DEBUG_CONSOLE_CREATE_BINARY_SEMAPHORE( s_debugConsoleReadWaitSemaphore );
        #endif

        {
            status = ( status_t ) SerialManager_OpenWriteHandle(
                s_debugConsoleState.serialHandle, ( ( serial_write_handle_t ) &s_debugConsoleState.serialWriteHandleBuffer[ 0 ] ) );
            assert( kStatus_SerialManager_Success == status );
            #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
                ( void ) SerialManager_InstallTxCallback( ( ( serial_write_handle_t ) &s_debugConsoleState.serialWriteHandleBuffer[ 0 ] ),
                                                          DbgConsole_SerialManagerTxCallback, &s_debugConsoleState );
            #endif
        }

        #if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) )
        {
            status = ( status_t ) SerialManager_OpenReadHandle(
                s_debugConsoleState.serialHandle, ( ( serial_read_handle_t ) &s_debugConsoleState.serialReadHandleBuffer[ 0 ] ) );
            assert( kStatus_SerialManager_Success == status );
            #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
                ( void ) SerialManager_InstallRxCallback( ( ( serial_read_handle_t ) &s_debugConsoleState.serialReadHandleBuffer[ 0 ] ),
                                                          DbgConsole_SerialManagerRxCallback, &s_debugConsoleState );
            #endif
        }
        #endif

        g_serialHandle = s_debugConsoleState.serialHandle;

        return kStatus_Success;
    }

/* See fsl_debug_console.h for documentation of this function. */
    status_t DbgConsole_Deinit( void )
    {
        {
            if( s_debugConsoleState.serialHandle != NULL )
            {
                ( void ) SerialManager_CloseWriteHandle(
                    ( ( serial_write_handle_t ) &s_debugConsoleState.serialWriteHandleBuffer[ 0 ] ) );
            }
        }
        #if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) )
        {
            if( s_debugConsoleState.serialHandle != NULL )
            {
                ( void ) SerialManager_CloseReadHandle( ( ( serial_read_handle_t ) &s_debugConsoleState.serialReadHandleBuffer[ 0 ] ) );
            }
        }
        #endif

        if( s_debugConsoleState.serialHandle )
        {
            if( kStatus_SerialManager_Success == SerialManager_Deinit( s_debugConsoleState.serialHandle ) )
            {
                s_debugConsoleState.serialHandle = NULL;
                g_serialHandle = NULL;
            }
        }

        #if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) )
            DEBUG_CONSOLE_DESTROY_BINARY_SEMAPHORE( s_debugConsoleReadWaitSemaphore );
        #endif
        DEBUG_CONSOLE_DESTROY_MUTEX_SEMAPHORE( s_debugConsoleReadSemaphore );

        return ( status_t ) kStatus_Success;
    }
#endif /* ((SDK_DEBUGCONSOLE == DEBUGCONSOLE_REDIRECT_TO_SDK) || defined(SDK_DEBUGCONSOLE_UART)) */

#if ( ( SDK_DEBUGCONSOLE > 0U ) ||                                                    \
    ( ( SDK_DEBUGCONSOLE == 0U ) && defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING ) && \
    ( defined( DEBUG_CONSOLE_TX_RELIABLE_ENABLE ) && ( DEBUG_CONSOLE_TX_RELIABLE_ENABLE > 0U ) ) ) )
    DEBUG_CONSOLE_FUNCTION_PREFIX status_t DbgConsole_Flush( void )
    {
        #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
            #if ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_BM ) && defined( OSA_USED )
                if( s_debugConsoleState.writeRingBuffer.ringHead != s_debugConsoleState.writeRingBuffer.ringTail )
                {
                    return ( status_t ) kStatus_Fail;
                }
            #else
                while( s_debugConsoleState.writeRingBuffer.ringHead != s_debugConsoleState.writeRingBuffer.ringTail )
                {
                    #if ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_FREERTOS )
                        if( 0U == IS_RUNNING_IN_ISR() )
                        {
                            if( taskSCHEDULER_RUNNING == xTaskGetSchedulerState() )
                            {
                                vTaskDelay( 1 );
                            }
                        }
                        else
                        {
                            return ( status_t ) kStatus_Fail;
                        }
                    #endif /* if ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_FREERTOS ) */
                }
            #endif /* if ( DEBUG_CONSOLE_SYNCHRONIZATION_MODE == DEBUG_CONSOLE_SYNCHRONIZATION_BM ) && defined( OSA_USED ) */
        #endif /* if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING ) */
        return ( status_t ) kStatus_Success;
    }
#endif /* if ( ( SDK_DEBUGCONSOLE > 0U ) || ( ( SDK_DEBUGCONSOLE == 0U ) && defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING ) && ( defined( DEBUG_CONSOLE_TX_RELIABLE_ENABLE ) && ( DEBUG_CONSOLE_TX_RELIABLE_ENABLE > 0U ) ) ) ) */

#if SDK_DEBUGCONSOLE
/* See fsl_debug_console.h for documentation of this function. */
    int DbgConsole_Printf( const char * formatString,
                           ... )
    {
        va_list ap;
        int logLength = 0, dbgResult = 0;
        char printBuf[ DEBUG_CONSOLE_PRINTF_MAX_LOG_LEN ] = { '\0' };

        if( NULL == g_serialHandle )
        {
            return 0;
        }

        va_start( ap, formatString );
        /* format print log first */
        logLength = StrFormatPrintf( formatString, ap, printBuf, DbgConsole_PrintCallback );
        /* print log */
        dbgResult = DbgConsole_SendDataReliable( ( uint8_t * ) printBuf, ( size_t ) logLength );

        va_end( ap );

        return dbgResult;
    }

/* See fsl_debug_console.h for documentation of this function. */
    int DbgConsole_Putchar( int ch )
    {
        /* print char */
        return DbgConsole_SendDataReliable( ( uint8_t * ) &ch, 1U );
    }

/* See fsl_debug_console.h for documentation of this function. */
    int DbgConsole_Scanf( char * formatString,
                          ... )
    {
        va_list ap;
        int formatResult;
        char scanfBuf[ DEBUG_CONSOLE_SCANF_MAX_LOG_LEN + 1U ] = { '\0' };

        /* scanf log */
        ( void ) DbgConsole_ReadLine( ( uint8_t * ) scanfBuf, DEBUG_CONSOLE_SCANF_MAX_LOG_LEN );
        /* get va_list */
        va_start( ap, formatString );
        /* format scanf log */
        formatResult = StrFormatScanf( scanfBuf, formatString, ap );

        va_end( ap );

        return formatResult;
    }
/* See fsl_debug_console.h for documentation of this function. */
    int DbgConsole_BlockingPrintf( const char * formatString,
                                   ... )
    {
        va_list ap;
        status_t status = ( status_t ) kStatus_SerialManager_Error;
        int logLength = 0, dbgResult = 0;
        char printBuf[ DEBUG_CONSOLE_PRINTF_MAX_LOG_LEN ] = { '\0' };

        if( NULL == g_serialHandle )
        {
            return 0;
        }

        va_start( ap, formatString );
        /* format print log first */
        logLength = StrFormatPrintf( formatString, ap, printBuf, DbgConsole_PrintCallback );

