FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_debug_console.c
        #if defined( DEBUG_CONSOLE_TRANSFER_NON_BLOCKING )
            SerialManager_CancelWriting( ( ( serial_write_handle_t ) &s_debugConsoleState.serialWriteHandleBuffer[ 0 ] ) );
        #endif
        /* print log */
        status =
            ( status_t ) SerialManager_WriteBlocking( ( ( serial_write_handle_t ) &s_debugConsoleState.serialWriteHandleBuffer[ 0 ] ),
                                                      ( uint8_t * ) printBuf, ( size_t ) logLength );
        dbgResult = ( ( ( status_t ) kStatus_Success == status ) ? ( int ) logLength : -1 );
        va_end( ap );

        return dbgResult;
    }

    #ifdef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        status_t DbgConsole_TryGetchar( char * ch )
        {
            #if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) )
                uint32_t length = 0;
                status_t status = ( status_t ) kStatus_Fail;

                assert( ch );

                if( NULL == g_serialHandle )
                {
                    return kStatus_Fail;
                }

                /* take mutex lock function */
                DEBUG_CONSOLE_TAKE_MUTEX_SEMAPHORE_BLOCKING( s_debugConsoleReadSemaphore );

                if( kStatus_SerialManager_Success ==
                    SerialManager_TryRead( ( ( serial_read_handle_t ) &s_debugConsoleState.serialReadHandleBuffer[ 0 ] ), ( uint8_t * ) ch, 1,
                                           &length ) )
                {
                    if( length != 0U )
                    {
                        #if DEBUG_CONSOLE_ENABLE_ECHO_FUNCTION
                            ( void ) DbgConsole_EchoCharacter( ( uint8_t * ) ch, true, NULL );
                        #endif
                        status = ( status_t ) kStatus_Success;
                    }
                }

                /* release mutex lock function */
                DEBUG_CONSOLE_GIVE_MUTEX_SEMAPHORE( s_debugConsoleReadSemaphore );
                return status;
            #else  /* if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) ) */
                return ( status_t ) kStatus_Fail;
            #endif /* if ( defined( DEBUG_CONSOLE_RX_ENABLE ) && ( DEBUG_CONSOLE_RX_ENABLE > 0U ) ) */
        }
    #endif /* ifdef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING */

/* See fsl_debug_console.h for documentation of this function. */
    int DbgConsole_Getchar( void )
    {
        uint8_t ch = 0U;

        /* Get char */
        ( void ) DbgConsole_ReadCharacter( &ch );

        return ( int ) ch;
    }

#endif /* SDK_DEBUGCONSOLE */

/*************Code to support toolchain's printf, scanf *******************************/
/* These function __write and __read is used to support IAR toolchain to printf and scanf*/
#if ( defined( __ICCARM__ ) )
    #if defined( SDK_DEBUGCONSOLE_UART )
        #pragma weak __write
        size_t __write( int handle,
                        const unsigned char * buffer,
                        size_t size )
        {
            if( buffer == 0 )
            {
                /*
                 * This means that we should flush internal buffers.  Since we don't we just return.
                 * (Remember, "handle" == -1 means that all handles should be flushed.)
                 */
                return 0;
            }

            /* This function only writes to "standard out" and "standard err" for all other file handles it returns failure. */
            if( ( handle != 1 ) && ( handle != 2 ) )
            {
                return( ( size_t ) -1 );
            }

            /* Send data. */
            DbgConsole_SendDataReliable( ( uint8_t * ) buffer, size );

            return size;
        }

        #pragma weak __read
        size_t __read( int handle,
                       unsigned char * buffer,
                       size_t size )
        {
            uint8_t ch = 0U;
            int actualSize = 0U;

            /* This function only reads from "standard in", for all other file  handles it returns failure. */
            if( handle != 0 )
            {
                return( ( size_t ) -1 );
            }

            /* Receive data.*/
            for( ; size > 0; size-- )
            {
                DbgConsole_ReadCharacter( &ch );

                if( ch == 0 )
                {
                    break;
                }

                *buffer++ = ch;
                actualSize++;
            }

            return actualSize;
        }
    #endif /* SDK_DEBUGCONSOLE_UART */

/* support LPC Xpresso with RedLib */
#elif ( defined( __REDLIB__ ) )

    #if ( defined( SDK_DEBUGCONSOLE_UART ) )
        int __attribute__( ( weak ) ) __sys_write( int handle,
                                                   char * buffer,
                                                   int size )
        {
            if( buffer == 0 )
            {
                /* return -1 if error. */
                return -1;
            }

            /* This function only writes to "standard out" and "standard err" for all other file handles it returns failure. */
            if( ( handle != 1 ) && ( handle != 2 ) )
            {
                return -1;
            }

            /* Send data. */
            DbgConsole_SendDataReliable( ( uint8_t * ) buffer, size );

            return 0;
        }

        int __attribute__( ( weak ) ) __sys_readc( void )
        {
            char tmp;

            /* Receive data. */
            DbgConsole_ReadCharacter( ( uint8_t * ) &tmp );

            return tmp;
        }
    #endif /* if ( defined( SDK_DEBUGCONSOLE_UART ) ) */

/* These function fputc and fgetc is used to support KEIL toolchain to printf and scanf*/
#elif defined( __CC_ARM ) || defined( __ARMCC_VERSION )
    #if defined( SDK_DEBUGCONSOLE_UART )
        #if defined( __CC_ARM )
            struct __FILE
            {
                int handle;

                /*
                 * Whatever you require here. If the only file you are using is standard output using printf() for debugging,
                 * no file handling is required.
                 */
            };
        #endif

/* FILE is typedef in stdio.h. */
        #pragma weak __stdout
        #pragma weak __stdin
        FILE __stdout;
        FILE __stdin;

