FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_LPC54018_MCUXpresso/NXP_Code/utilities/fsl_debug_console.c
        #pragma weak fputc
        int fputc( int ch,
                   FILE * f )
        {
            /* Send data. */
            return DbgConsole_SendDataReliable( ( uint8_t * ) ( &ch ), 1 );
        }

        #pragma weak fgetc
        int fgetc( FILE * f )
        {
            char ch;

            /* Receive data. */
            DbgConsole_ReadCharacter( ( uint8_t * ) &ch );

            return ch;
        }

/*
 * Terminate the program, passing a return code back to the user.
 * This function may not return.
 */
        void _sys_exit( int returncode )
        {
            while( 1 )
            {
            }
        }

/*
 * Writes a character to the output channel. This function is used
 * for last-resort error message output.
 */
        void _ttywrch( int ch )
        {
            char ench = ch;

            DbgConsole_SendDataReliable( ( uint8_t * ) ( &ench ), 1 );
        }

        char * _sys_command_string( char * cmd,
                                    int len )
        {
            return( cmd );
        }
    #endif /* SDK_DEBUGCONSOLE_UART */

/* These function __write and __read is used to support ARM_GCC, KDS, Atollic toolchains to printf and scanf*/
#elif ( defined( __GNUC__ ) )

    #if ( ( defined( __GNUC__ ) && ( !defined( __MCUXPRESSO ) ) && ( defined( SDK_DEBUGCONSOLE_UART ) ) ) || \
    ( defined( __MCUXPRESSO ) && ( defined( SDK_DEBUGCONSOLE_UART ) ) ) )
        int __attribute__( ( weak ) ) _write( int handle,
                                              char * buffer,
                                              int size );
        int __attribute__( ( weak ) ) _write( int handle,
                                              char * buffer,
                                              int size )
        {
            if( buffer == NULL )
            {
                /* return -1 if error. */
                return -1;
            }

            /* This function only writes to "standard out" and "standard err" for all other file handles it returns failure. */
            if( ( handle != 1 ) && ( handle != 2 ) )
            {
                return -1;
            }

            /* Send data. */
            ( void ) DbgConsole_SendDataReliable( ( uint8_t * ) buffer, ( size_t ) size );

            return size;
        }

        int __attribute__( ( weak ) ) _read( int handle,
                                             char * buffer,
                                             int size );
        int __attribute__( ( weak ) ) _read( int handle,
                                             char * buffer,
                                             int size )
        {
            uint8_t ch = 0U;
            int actualSize = 0;

            /* This function only reads from "standard in", for all other file handles it returns failure. */
            if( handle != 0 )
            {
                return -1;
            }

            /* Receive data. */
            for( ; size > 0; size-- )
            {
                if( DbgConsole_ReadCharacter( &ch ) < 0 )
                {
                    break;
                }

                *buffer++ = ( char ) ch;
                actualSize++;

                if( ( ch == 0U ) || ( ch == ( uint8_t ) '\n' ) || ( ch == ( uint8_t ) '\r' ) )
                {
                    break;
                }
            }

            return ( actualSize > 0 ) ? actualSize : -1;
        }
    #endif /* if ( ( defined( __GNUC__ ) && ( !defined( __MCUXPRESSO ) ) && ( defined( SDK_DEBUGCONSOLE_UART ) ) ) || ( defined( __MCUXPRESSO ) && ( defined( SDK_DEBUGCONSOLE_UART ) ) ) ) */

#endif /* __ICCARM__ */
